app/controllers/citas_controller.rb

SELECT "vehiculos"."id" FROM "vehiculos" WHERE ("vehiculos"."placa" = '122BWR') LIMIT 1
INSERT INTO "vehiculos" ("created_at", "placa", "updated_at") VALUES ('2010-11-12 19:09:26.126363', '1', '2010-11-12 19:09:26.126363')
INSERT INTO "citas" ("cliente_id", "created_at", "estados_id", "fecha", "hora", "updated_at") VALUES (1, '2010-11-12 19:29:35.483114', 1, '2010-12-31', 15, '2010-11-12 19:29:35.483114')
---
  def create

    c_placa = params[:placa].upcase
    c_fecha = params[:fecha]
    c_hora = params[:hora]

    # buscar si vehiculo existe
    @vehiculo = Vehiculo.find_by_placa(c_placa)

    if @vehiculo.nil?
      #crear nuevo vehiculo
      @vehiculo = Vehiculo.new(:placa => c_placa)
      unless @vehiculo.save
        @error_code = 500
        @error_description = "Error al crear vehiculo. #{@vehiculo.errors}"
      end
    end

    @cita = Cita.new(:fecha => Date.parse(c_fecha),
                     :hora => c_hora.to_i,
                     :cliente_id => @vehiculo.id,
                     :estados_id => 1)

    unless @cita.save

SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "citas" WHERE (fecha = '2010-12-31' and hora = 6)) AS subquery
SELECT hora FROM "citas" WHERE (fecha = '2010-12-31')
---
  def find
    d_fecha = Date.parse(params[:fecha])

    unless params[:hora].nil?
      i_hora = params[:hora].to_i
      citas = Cita.where("fecha = ? and hora = ?", d_fecha, i_hora).count
      # 1 : ocupado
      # 0 : libre
      @disponible = citas > 0 ? 1 : 0
    else
      citas = Cita.select('hora').where("fecha = ?", d_fecha)