app/controllers/citas_controller.rb

SELECT "citas".* FROM "citas"
---
  def index
    @citas = Cita.all