app/controllers/main_controller.rb

INSERT INTO "ordendetalles" ("created_at", "descripcion", "orden_id", "servicio_id", "updated_at") VALUES ('2010-11-13 05:17:17.735743', 'Algo que describir', 1, 1, '2010-11-13 05:17:17.735743')
---
  def create_servicio
    i_orden_id = params[:orden_id]
    i_servicio_id = params[:servicio_id]

    #revisar que orden exista
    if (@orden = Orden.find(i_orden_id))

      #pedir description del servicio
      url_servicio = "http://localhost:3001/servicio_nombre/#{i_servicio_id}.xml"
      puts url_servicio
      servicio = Nokogiri::XML(open(url_servicio))

      if servicio.at_css('error').nil?
        nombre = servicio.at_css('nombre').text

        @ordendetalle = Ordendetalle.new(:orden_id => @orden.id,
                                         :servicio_id => i_servicio_id,
                                         :descripcion => nombre)
        unless @ordendetalle.save

SELECT "citas".* FROM "citas" WHERE ("citas"."id" = 45) LIMIT 1
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "citas" WHERE (id = '45')) AS subquery
INSERT INTO "ordenes" ("cita_id", "created_at", "estado_id", "updated_at") VALUES (1, '2010-11-12 21:42:49.552507', 1, '2010-11-12 21:42:49.552507')
---
  def create_orden
    i_cita_id = params[:cita_id]

    @cita = Cita.where("id = ?", i_cita_id)
    if @cita.empty?
      @error_code = 500
      @error_description = "Numero de cita invalido"
    else
      #buscar si ya existe
      @orden = Orden.where(:cita_id => @cita[0].id)

      if @orden.empty?
        #crear orden
        @orden = Orden.new(:cita_id => @cita[0].id,
                           :estado_id => Orden::ESTADO_RECIBIDO)

        unless @orden.save